app/controllers/timelogs_controller.rb

SELECT * FROM "timelogs" WHERE ("timelogs"."id" = '--- :end
SELECT `timelogs`.* FROM `timelogs` ORDER BY `timelogs`.`id` DESC LIMIT 1
---
  def index

    @inlog = false
    @lastlog = Timelog.find(:last)
    if @lastlog.endtime == nil or @lastlog.endtime.to_s == '' then
      @inlog = false
    else
      @inlog = true
    end

    @timelogs = Timelog.find(:all)
    @timelog = Timelog.new
    count = 0
    @average = ''
    avInMins = 0
    hrs=0
    mins=0
    tottime = 0
    toiltime = 0
    nonworktime = 0

    if @timelogs != nil and @timelogs.size > 0

SELECT `timelogs`.* FROM `timelogs` WHERE `timelogs`.`id` = 1 LIMIT 1
---
  def edit
    @timelog = Timelog.find(params[:id])

INSERT INTO "timelogs" ("endtime", "evening", "updated_at", "total", "starttime", "lunchbreak", "created_at") VALUES('2009-07-30 17:45:00', NULL, '2009-09-16 09:05:06', NULL, '2009-07-30 07:50:00', 110, '2009-09-16 09:05:06')
SELECT * FROM "timelogs" WHERE ("timelogs"."id" = 38)
UPDATE "timelogs" SET "total" = 780, "updated_at" = '2009-09-16 09:24:21' WHERE "id" = 5
---
  def create
    @timelog = Timelog.new(params[:timelog])
    if @timelog.lunchbreak == nil
      @timelog.update_attributes!(:lunchbreak => 30)
    end
    if @timelog.extra == nil
      @timelog.update_attributes!(:extra => 0)
    end
    respond_to do |format|
      if @timelog.save
        flash[:notice] = 'Time logged successfully.'
        @log = Timelog.find(@timelog.id)
        if @log.endtime != nil && @log.lunchbreak != nil && @log.extra != nil
          @timelog.update_attributes(params[:timelog].merge(:total => ((@timelog.endtime - @timelog.starttime)/60) - @timelog.lunchbreak + @timelog.extra))

SELECT `timelogs`.* FROM `timelogs` WHERE `timelogs`.`id` = 1 LIMIT 1
UPDATE `timelogs` SET `notes` = 'There once was a man called Wibble, who had a puppet called Mr. Flibble. He slipped in his hand and wiggled and fanned... then made his friend giggle and dribble.', `total` = -30, `updated_at` = '2014-02-20 16:20:31' WHERE `timelogs`.`id` = 40
---
  def update
    @timelog = Timelog.find(params[:id])

    respond_to do |format|
      if @timelog.update_attributes(params[:timelog])

INSERT INTO `timelogs` (`non_working`, `endtime`, `created_at`, `updated_at`, `notes`, `total`, `starttime`, `extra`, `lunchbreak`, `toil`) VALUES(NULL, NULL, '2010-07-06 23:54:27', '2010-07-06 23:54:27', NULL, NULL, NULL, NULL, NULL, NULL)
---
  def lognonwork
    @timelog = Timelog.new
    respond_to do |format|
      if @timelog.save

INSERT INTO `timelogs` (`non_working`, `endtime`, `created_at`, `updated_at`, `notes`, `total`, `starttime`, `extra`, `lunchbreak`, `toil`) VALUES(NULL, NULL, '2010-07-06 21:55:09', '2010-07-06 21:55:09', NULL, NULL, NULL, NULL, NULL, NULL)
---
  def logtoil
    @timelog = Timelog.new
    respond_to do |format|
      if @timelog.save

INSERT INTO `timelogs` (`non_working`, `endtime`, `created_at`, `updated_at`, `notes`, `total`, `starttime`, `extra`, `lunchbreak`, `toil`) VALUES(NULL, NULL, '2010-07-06 21:55:22', '2010-07-06 21:55:22', NULL, NULL, NULL, NULL, NULL, NULL)
---
  def login
    @timelog = Timelog.new
    respond_to do |format|
      if @timelog.save

SELECT `timelogs`.* FROM `timelogs` WHERE `timelogs`.`id` = 8 LIMIT 1
UPDATE `timelogs` SET `endtime` = '2014-02-20 17:26:37', `updated_at` = '2014-02-20 17:26:37', `total` = -29 WHERE `timelogs`.`id` = 129
---
  def logout
    @timelog = Timelog.find(Timelog.maximum(:id))
    if @timelog.endtime == nil
      respond_to do |format|
        if @timelog.update_attributes!(:endtime => Time.now)

SELECT `timelogs`.* FROM `timelogs` WHERE `timelogs`.`id` = 7 LIMIT 1
DELETE FROM `timelogs` WHERE `timelogs`.`id` = 7
---
  def destroy
    @timelog = Timelog.find(params[:id])
    @timelog.destroy